Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/houses_of_the_oireachtas/dail_eireann.html.txt.tmx
Source language: en
Languages: ga

source: Dáil Éireann is one of the Houses of the Oireachtas, the national parliament
ga: Is ceann de Thithe an Oireachtais é Dáil Éireann

source: Dáil Éireann is located in Dublin
ga: Is é an tOireachtas ár bparlaimint náisiúnta

source: The Dáil consists of members of the Dáil or TDs – Teachta Dála
ga: Tá an Dáil déanta suas de bhaill na Dála nó Teachtaí Dála

source: They are also known as Deputies. TDs are elected directly to the Dáil in a general election
ga: Bíonn TD tofa díreach chun na Dála ag muintir na hÉireann le linn olltoghcháin

source: If a vacancy occurs at the Dáil, the seat will be filled by a bye-election
ga: Má bhíonn folúntas sa Dáil, déanfar an suíochán a líonadh trí fhothoghchán

source: There is a list of current TDs, grouped alphabetically by name or by constituency
ga: Tá liosta Teachtaí Dála, grúpáilte in ord aibítre de réir ainm nó Teachtaí Dála grúpáilte de réir toghcheantair ar fáil

source: The Constitution states that the number of TDs cannot be more than one for every 20,000 of the population and cannot be less than one for every 30,000
ga: Léiríonn Bunreacht na hÉireann nach féidir ach le Teachta Dála amháin in aghaidh gach 20,000 duine suíochán a bheith aige/aici sa Dáil agus nach féidir leis an uimhir a bheith níos lú ná duine in aghaidh gach 30,000 duine

source: There are currently 158 TDs
ga: I láthair na huaire tá 158 TD againn

source: The country is divided into 40 constituencies and every constituency must elect at least three members to the Dáil
ga: Tá an tír roinnte i 40 Dáil cheantar agus tá ar gach Dáil cheantar triúr, ar a laghad, a thogh chun na Dála

source: As far as possible, the ratio of population to TD must be equal in each constituency
ga: Chomh gar agus is féidir, ní mór don chóimheas Teachta Dála agus daonra a bheith mar an gcéanna i ngach Dáil cheantar

source: The constituencies must be revised at least once every 12 years, although in practice they are revised after the census is published every 5 years
ga: Tá athbhreithniú le déanamh ar na dáil cheantair gach 12 bliain ach is gnáthach go ndéantar é tar éis Daonáirimh a tharlaíonn gach 5 bliana

source: An independent Constituency Commission is appointed to draw up a revised scheme of constituencies which is then given effect by an Act of the Oireachtas
ga: Ceaptar Coimisiún Toghlaigh neamhspleách chun scéim toghcheantar athbhreithnithe a dhréachtú a gcuirfidh i bhfeidhm tríd Acht an Oireachtais

source: TDs represent and work on behalf of the electors in their constituency
ga: Déanann Teachtaí Dála ionadaíocht ar son na dtoghdóirí ina nDáil cheantar agus déanann said obair dóibh

source: The maximum life of the Dáil is 5 years, although at any time the Taoiseach may advise the President to dissolve the Dáil
ga: Ní féidir leis an Dáil dul thar 5 bliana ach is féidir leis an Taoiseach, ag aon am, iarradh ar an Uachtarán an Dáil a lánscoir

source: You can view information on the weekly schedule in the Houses of the Oireachtas
ga: Féadfar faisnéis a fheiceáil ar sceideal seachtainiúil Thithe an Oireachtais
